
console.log('Ответ задача 1');

let max = 999;
let digit = {
    number: Math.round(Math.random() * max),
    units: 0,
    tens: 0,
    hundreds: 0,
};
if (digit.number <= 9){
    digit.units = digit.number;
} else if (digit.number <= 999){
    digit.units = Math.floor(digit.number % 10);
    digit.tens = Math.floor(digit.number / 10 % 10);
    digit.hundreds = Math.floor(digit.number / 100 % 10);
}else {
    digit.number = 0;
    console.log('Вы ввели число за диапазоном 0 - 999');
}
console.log(digit);


<!DOCTYPE html>
<html lang="en">
    <head>
    <meta charset="UTF-8">
    <title>Title</title>
    </head>
    <body>

    <!--Задача 3. Реализовать игру <<Кто хочет стать миллионером?>>-->

<script>
console.log("Добро пожаловать в игру «Кто хочет стать миллионером?»");

const questionList = [
    'Что выносит в зал распорядитель в телепередаче «Что? Где? Когда?»?',
    'Что обычно лежит на столе у офисных работников?',
    'Что у болтливого человека без костей, если верить поговорке?',
    'Чему или кому в песне из советского фильма не призывают порадоваться мушкетеры?',
    'Что помогает дачнику вспахать огород?',
    'Что в русском языке пишется после приставок, оканчивающихся на согласную перед буквами Е, Ё, Ю, Я?',
    'С помощью какого оружия библейский Давид поразил Голиафа?',
    'Какой газ не является инертным?',
    'Кто, как считается, подсказал Николаю Васильевичу Гоголю идею «Ревизора»?',
    'Музей какого бытового устройства находится в городе Переславль-Залесский?'];

const gain = [1000, 3000, 5000, 'первую несгораемую сумму 10000', 20000, 60000, 80000,
    'вторую несгораемую сумму 100000', 500000, 1000000];

const answers = [['A: черный ящик B: черную метку C: вердикт  D: мусор '],['A: ступор B: штопор C: стопор D: степлер '],['A: ухо B: язык C: нос D: руки'],
    ['A: кубку B: королеве C: клинку D: красавице'],['A: сатуратор B: элеватор C: ирригатор D: культиватор'],
    ['A: мягкий знак B: твердый знак C: удвоенная согласная D: дефис'],['A: лук B: копье C: топор D: праща'],
    ['A: криптон B: радон C: пропан D: гелий'],['A: Александр Сергеевич Пушкин B: Владимир Иванович Даль C: Иван Андреевич Крылов D: Александр Сергеевич Грибоедов'],
    ['A: мясорубка B: прялка C: утюг D: маслобойка']];

let correct = ['A','D','B','B','D','B','D','C','A','c'];

let a = 0;
let b = 1;
for(let i = 0; i < 10; i++) {
    let answer = prompt('Вопрос ' + b + ': ' + questionList[i]+'\r\n'+ 'Варианты ответа: \r\n' + answers[0] + '\r\n' + 'Ваш ответ?');
    if(answer.toUpperCase() == correct[0]) {
        console.log('Поздравляю вы выиграли ' + gain[a] + ' рублей');
        a++;
        b++;
        answers.shift(0);
        correct.shift(0);
    }else if (gain[a] >= 100000){
        console.log('Ответ неверный. Вы выиграли ' + gain[7] + ' рублей');
        break;
    }else if (gain[a] >= 10000){
        console.log('Ответ неверный. Вы выиграли ' + gain[3] + ' рублей');
        break;
    }else{
        console.log('Ответ неверный');
        break;
    }
}
</script>
</body>
</html>